# St7SetLinkLabelStyle

Sets the display style for link labels.

long St7SetLinkLabelStyle(long uID, long LabelStyle)

Input Parameters

uID

Strand7 model file ID.

LabelStyle

One of lsNone, lsEntityNumber, lsIDNumber or lsLinkType.

Dependencies
Font

Assigned using St7SetEntityFont.

Link Entity Display